// data/hospitalsData.ts
export interface Hospital {
  id: number;
  name: string;
  city: string;
  phone: string;
  image?: string;
  type?:string;
}

export const hospitalsData: Hospital[] = [


    
  { id: 1, name: "مستشفى الرحمة", city: "القاهرة", phone: "+201234567890" },
  { id: 2, name: "مستشفى النيل", city: "الإسكندرية", phone: "+201234567891" },
  { id: 3, name: "مستشفى السلام", city: "الجيزة", phone: "+201234567892" },
  { id: 4, name: "مستشفى الأمل", city: "أسوان", phone: "+201234567893" },
  { id: 5, name: "مستشفى الشفاء", city: "السويس", phone: "+201234567894" },
  { id: 6, name: "مستشفى الحياة", city: "الأقصر", phone: "+201234567895" },
  { id: 7, name: "مستشفى المعادي", city: "القاهرة", phone: "+201234567896" },
  { id: 8, name: "مستشفى أكتوبر", city: "الجيزة", phone: "+201234567897" },
  { id: 9, name: "مستشفى فيصل", city: "الإسكندرية", phone: "+201234567898" },
  { id: 10, name: "مستشفى برج العرب", city: "الإسكندرية", phone: "+201234567899" },
  { id: 11, name: "مستشفى المطرية", city: "القاهرة", phone: "+201234567900" },
  { id: 12, name: "مستشفى شبرا", city: "القاهرة", phone: "+201234567901" },
  { id: 13, name: "مستشفى طنطا", city: "طنطا", phone: "+201234567902" },
  { id: 14, name: "مستشفى المنصورة", city: "المنصورة", phone: "+201234567903" },
  { id: 15, name: "مستشفى دمنهور", city: "دمنهور", phone: "+201234567904" },
  { id: 16, name: "مستشفى المحلة", city: "المحلة", phone: "+201234567905" },
  { id: 17, name: "مستشفى الزقازيق", city: "الزقازيق", phone: "+201234567906" },
  { id: 18, name: "مستشفى الإسماعيلية", city: "الإسماعيلية", phone: "+201234567907" },
  { id: 19, name: "مستشفى السويس", city: "السويس", phone: "+201234567908" },
  { id: 20, name: "مستشفى الأقصر الدولي", city: "الأقصر", phone: "+201234567909" },
 { id: 21, name: "مستشفى القوات المسلحة – القاهرة", city: "القاهرة", phone: "+201234567910", type: "حكومي" },
  { id: 22, name: "مستشفى القوات المسلحة – الإسكندرية", city: "الإسكندرية", phone: "+201234567911", type: "حكومي" },
  { id: 26, name: "مستشفى القوات المسلحة – أسوان", city: "أسوان", phone: "+201234567915"}
  
];